#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	MRS_НастройкиПодключенияКФронтСистемам.ФронтСистема КАК ФронтСистема, 
	               |	MRS_НастройкиПодключенияКФронтСистемам.ДатаЗапретаПодключения КАК ДатаЗапретаПодключения
	               |ИЗ
	               |	РегистрСведений.MRS_НастройкиПодключенияКФронтСистемам КАК MRS_НастройкиПодключенияКФронтСистемам";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	НастройкаДат.Загрузить(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ДатыЗапретаДатаЗапретаПриИзмененииНаСервере(Структура)
	Попытка
		Набор = РегистрыСведений.MRS_НастройкиПодключенияКФронтСистемам.СоздатьНаборЗаписей();
		Набор.Отбор.ФронтСистема.Установить(Структура.ФронтСистема);
		Набор.Прочитать();
		
		Для Каждого Запись из Набор Цикл
			
			Запись.ДатаЗапретаПодключения = Структура.ДатаЗапретаПодключения;
			
		КонецЦикла;
		
		Набор.Записать();                                                                                                 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата запрета подключения к " + Структура.ФронтСистема + " успешно установлена.");
		
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));	
		
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДатДатаЗапретаПодключенияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.НастройкаДат.ТекущиеДанные;
	
	Структура = Новый Структура;
	Структура.Вставить("ФронтСистема", ТекущиеДанные.ФронтСистема);
	Структура.Вставить("ДатаЗапретаПодключения", ТекущиеДанные.ДатаЗапретаПодключения);
	
	ДатыЗапретаДатаЗапретаПриИзмененииНаСервере(Структура);
	
КонецПроцедуры
#КонецОбласти


