
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ПолноеИмяОбъекта = ОбработкаОбъект.Метаданные().ПолноеИмя();

	СписокКасс = Параметры.СписокКасс;
	
	ВосстановитьОбщиеНастройки();
	ВосстановитьНастройкиКасс();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборТаблицы();
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборТаблицы()
		
	//Элементы.ТаблицаНастроекПоКассам.ОтборСтрок = Новый ФиксированнаяСтруктура("Токен",Токен);

КонецПроцедуры

&НаСервере
Процедура ВосстановитьОбщиеНастройки()
	
	ТекущийТокен = ХранилищеОбщихНастроек.Загрузить("MRS_ЗагрузкаДанныхИзФронтСистем","Token_LKK");
	РежимРазработчика = ХранилищеОбщихНастроек.Загрузить("MRS_ЗагрузкаДанныхИзФронтСистем","РежимРазработчика");
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ДанныеИзХранилища = ОбработкаОбъект.ВосстановитьОбщиеНастройки(); 
	ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеИзХранилища);
	
	Если ДанныеИзХранилища <> Неопределено И ДанныеИзХранилища.Свойство("Токен") И ДанныеИзХранилища.Токен = Неопределено Тогда 
		Токен = ТекущийТокен;
	КонецЕсли;
		
КонецПроцедуры 

&НаСервере
Процедура ВосстановитьНастройкиКасс() 
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ДанныеИзХранилища = ОбработкаОбъект.ВосстановитьНастройкиКасс(); 
	
	Если ДанныеИзХранилища <> Неопределено Тогда 
		Для Каждого Настройка из ДанныеИзХранилища Цикл 
			НоваяСтрока = ТаблицаНастроекПоКассам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Настройка.Значение);
			Если НоваяСтрока.Токен = "" Тогда
				НоваяСтрока.Токен = Токен;		
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;   
	
КонецПроцедуры
	
&НаКлиенте
Процедура КлючДоступаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ФормаСписокТокеновЗавершение", ЭтотОбъект); 
	
	ОткрытьФорму("Обработка.MRS_ЗагрузкаДанныхИзФронтСистем.Форма.СписокТокенов",,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры  

&НаКлиенте
Процедура ФормаСписокТокеновЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОчиститьСообщения();
	
	Если Результат <> Неопределено Тогда
    	Токен = Результат.Токен;
		СохранитьТокен();
		УстановитьОтборТаблицы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)     

	СохранитьНастройкиНаСервере();   
	
	СтруктураВозврата = Новый Структура("Токен,РежимРазработчика",Токен,РежимРазработчика);
	
	ЭтаФорма.Закрыть(СтруктураВозврата); 

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()

	СохранитьОсновныеНастройки();
	СохранитьНастройкиКасс();
	
	СохранитьТокен(); 
	
КонецПроцедуры 

&НаСервере
Процедура СохранитьТокен()
	
	ХранилищеОбщихНастроек.Сохранить("MRS_ЗагрузкаДанныхИзФронтСистем","Token_LKK",Токен); 
	ХранилищеОбщихНастроек.Сохранить("MRS_ЗагрузкаДанныхИзФронтСистем","РежимРазработчика",РежимРазработчика); 
	
КонецПроцедуры 

&НаСервере
Процедура СохранитьОсновныеНастройки()

	СтурктураПомещенияВХранилище = Новый Структура;
	СтурктураПомещенияВХранилище.Вставить("КлючОбъекта",	"MRS_ЗагрузкаДанныхИзФронтСистем");	
	СтурктураПомещенияВХранилище.Вставить("КлючНастроек",	"ОбщиеНастройкиОбработки_LKK");	

	МассивСтруктурДляСохранения = Новый Массив;   
	
	Соответствие = Новый Соответствие;	
	Соответствие.Вставить("Токен",					Токен);	
	Соответствие.Вставить("Организация",			Строка(Организация.УникальныйИдентификатор()));	
	Соответствие.Вставить("Склад",					Строка(Склад.УникальныйИдентификатор()));	
		
	МассивСтруктурДляСохранения.Добавить(Новый Структура("Соответствие",Соответствие));	
	
	СтурктураПомещенияВХранилище.Вставить("МассивСтруктурДляСохранения",МассивСтруктурДляСохранения);	

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СформироватьДвоичныеДанныеПодменJSON(СтурктураПомещенияВХранилище); 
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиКасс()

	СтурктураПомещенияВХранилище = Новый Структура;
	СтурктураПомещенияВХранилище.Вставить("КлючОбъекта",	"MRS_ЗагрузкаДанныхИзФронтСистем");	
	СтурктураПомещенияВХранилище.Вставить("КлючНастроек",	"НастройкиКасс_LKK");	

	МассивСтруктурДляСохранения = Новый Массив;   
	Для Каждого Касса Из ТаблицаНастроекПоКассам Цикл
		Если ЗначениеЗаполнено(Касса.РегНомер) И ЗначениеЗаполнено(Касса.Склад) Тогда 
			СоответствиеСтроки = Новый Соответствие;	
			СоответствиеСтроки.Вставить("РегИмя",						Касса.РегИмя);	
			СоответствиеСтроки.Вставить("РегНомер",						Касса.РегНомер);	
			СоответствиеСтроки.Вставить("Организация",					Строка(Касса.Организация.УникальныйИдентификатор()));	
			СоответствиеСтроки.Вставить("Склад",						Строка(Касса.Склад.УникальныйИдентификатор()));	
				
			МассивСтруктурДляСохранения.Добавить(Новый Структура("Соответствие",СоответствиеСтроки));

		КонецЕсли;
    КонецЦикла;
	СтурктураПомещенияВХранилище.Вставить("МассивСтруктурДляСохранения",МассивСтруктурДляСохранения);	

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СформироватьДвоичныеДанныеПодменJSON(СтурктураПомещенияВХранилище); 
	
КонецПроцедуры

&НаКлиенте
Процедура РегНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ВыборРегНомера", ЭтотОбъект); 
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВыборНескольких", Ложь);   
	
	ОткрытьФорму("Обработка.MRS_ЗагрузкаДанныхИзФронтСистем.Форма.СписокККТ",СтруктураПараметров,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыборРегНомера(ДанныеВыбора, Параметры) Экспорт 

	Если ДанныеВыбора <> Неопределено Тогда 
		Строка = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
		Строка.РегНомер	 = ДанныеВыбора.Список[0].Значение;	
		Строка.РегИмя	 = ДанныеВыбора.Список[0].Представление;	
		Строка.Токен	 = Токен;	
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура РегНомерОчистка(Элемент, СтандартнаяОбработка)
	Строка = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	Строка.РегНомер	 = "";	
КонецПроцедуры


Процедура УстановитьДоступность(ИмяЭлемента,Значение)
	Элементы[ИмяЭлемента].Доступность = Значение;	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаКлючНажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("https://https://lk.platformaofd.ru/web/login");
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаНастроекПоКассамВариантЗагрузкиЧековНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
    Оповещение = Новый ОписаниеОповещения("ОкончаниеВыбораВариантаЗагрузки",ЭтотОбъект, Новый Структура("Строка",Элементы.ТаблицаНастроекПоКассам.ТекущиеДанные));

	ПоказатьВыборИзСписка(Оповещение,Элементы.ВариантЗагрузкиЧеков.СписокВыбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораВариантаЗагрузки(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда 
		ДополнительныеПараметры.Строка.ВариантЗагрузкиЧеков = Результат.Значение;		
	КонецЕсли;
	
КонецПроцедуры 
